In [119]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series
import datetime
import time
import matplotlib.pyplot as plt
%matplotlib inline

In [120]:
usecols = ['CLNN', 'TS_D', 'FINAL_CD', 'SAA', 'MCT_ADM_GDS_APB_CD', 'DOF_TF', 'DAW_CCD', 'MCT_N', 'TIME']
trx_df = pd.read_csv('df.csv', usecols=usecols)
df = trx_df

In [7]:
trx_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 9 columns):
CLNN                  1000000 non-null int64
TS_D                  1000000 non-null object
FINAL_CD              1000000 non-null int64
SAA                   1000000 non-null int64
MCT_ADM_GDS_APB_CD    1000000 non-null int64
DOF_TF                1000000 non-null int64
DAW_CCD               1000000 non-null int64
MCT_N                 1000000 non-null int64
TIME                  1000000 non-null int64
dtypes: int64(8), object(1)
memory usage: 68.7+ MB

In [121]:
trx_df.head(6)

,CLNN,TS_D,FINAL_CD,SAA,MCT_ADM_GDS_APB_CD,DOF_TF,DAW_CCD,MCT_N,TIME
0,14437,2018-07-19,25,11,26,0,5,36,199982
1,2414,2018-07-09,10,7,35,0,0,88,57272
2,2136,2018-07-28,82,9,2,0,2,83,135636
3,15588,2018-07-13,72,16,21,1,1,60,156460
4,6377,2018-07-28,37,14,31,0,2,58,2430
5,1974,2018-07-05,89,20,58,0,5,78,28881

In [10]:
trx_df['SAA'][2:3]

2    9
Name: SAA, dtype: int64

In [12]:
trx_df['SAA'][2:3] == 9

2    True
Name: SAA, dtype: bool

In [15]:
min(trx_df['SAA'][2:3].values)

9

In [49]:
# To select rows whose column value is in list (not a single value)

DAW_CCD_list = [3, 5]
trx_df.DAW_CCD.isin(DAW_CCD_list)

0          True
1         False
2         False
3         False
4         False
5          True
6          True
7          True
8         False
9          True
10        False
11         True
12        False
13        False
14        False
15        False
16        False
17        False
18         True
19        False
20        False
21        False
22         True
23         True
24        False
25        False
26         True
27         True
28         True
29        False
          ...
999970    False
999971    False
999972    False
999973    False
999974    False
999975     True
999976     True
999977     True
999978    False
999979     True
999980    False
999981     True
999982    False
999983     True
999984     True
999985    False
999986    False
999987    False
999988    False
999989     True
999990     True
999991     True
999992     True
999993     True
999994    False
999995    False
999996    False
999997    False
999998    False
999999    False
Name: DAW_CCD, Length: 1000000, dtype: bool

In [50]:
trx_df_DAW_CCD = trx_df[trx_df.DAW_CCD.isin(DAW_CCD_list)]
trx_df_DAW_CCD.shape

(333766, 9)

In [51]:
trx_df_DAW_CCD.DAW_CCD.unique()

array([5, 3], dtype=int64)

In [52]:
trx_df_DAW_CCD.head(3)

,CLNN,TS_D,FINAL_CD,SAA,MCT_ADM_GDS_APB_CD,DOF_TF,DAW_CCD,MCT_N,TIME
0,14437,2018-07-19,25,11,26,0,5,36,199982
5,1974,2018-07-05,89,20,58,0,5,78,28881
6,3939,2018-07-14,97,11,23,1,5,97,199889

In [53]:
# Multiple Conditions

In [54]:
FINAL_CD_list = [25, 89, 97]

In [55]:
trx_df[~df.FINAL_CD.isin(FINAL_CD_list) & 
   trx_df.DAW_CCD.isin(DAW_CCD_list)] \
[:5]

,CLNN,TS_D,FINAL_CD,SAA,MCT_ADM_GDS_APB_CD,DOF_TF,DAW_CCD,MCT_N,TIME
7,6130,2018-07-18,28,10,12,0,3,66,61197
9,1072,2018-07-11,33,11,8,1,5,7,52381
11,9374,2018-07-24,30,21,55,0,5,89,194015
18,10060,2018-07-20,14,3,57,0,5,14,154157
23,12476,2018-07-04,8,13,35,0,5,63,18577

In [56]:
# 1. Create Boolean variable

is_day_5 = trx_df['DAW_CCD'] > 3
print(is_2002.head())

0     True
1    False
2    False
3    False
4    False
Name: DAW_CCD, dtype: bool

In [57]:
# 2. Filter rows for DAW_CCD > 3 using the boolean variable
day_5 = trx_df[is_day_5] 
print(day_5.shape)

(333603, 9)

In [58]:
# showing only DAW_CCD > 3
day_5.head()

,CLNN,TS_D,FINAL_CD,SAA,MCT_ADM_GDS_APB_CD,DOF_TF,DAW_CCD,MCT_N,TIME
0,14437,2018-07-19,25,11,26,0,5,36,199982
5,1974,2018-07-05,89,20,58,0,5,78,28881
6,3939,2018-07-14,97,11,23,1,5,97,199889
9,1072,2018-07-11,33,11,8,1,5,7,52381
10,918,2018-07-22,23,28,12,0,4,12,123726

In [59]:
# DAYS TIMES SEX_CCD AGE_GB MIN
# 2 02 M 01_25 9.68

In [ ]:
# IF condition – Set of numbers
# Here is the generic structure that you may apply in Python:
trx_df.loc[trx_df.column_name condition, 'new column name'] = 'value if condition is met'

In [75]:
Numbers = {'set_of_numbers': [1,2,3,4,5,6,7,8,9,10]}
trx_df = DataFrame(Numbers,columns=['set_of_numbers'])

trx_df.loc[trx_df.set_of_numbers <= 4, 'equal_or_lower_than_4?'] = 'True' 
trx_df.loc[trx_df.set_of_numbers > 4, 'equal_or_lower_than_4?'] = 'False' 

print(df)

   set_of_numbers equal_or_lower_than_4?
0               1                   True
1               2                   True
2               3                   True
3               4                   True
4               5                  False
5               6                  False
6               7                  False
7               8                  False
8               9                  False
9              10                  False

In [79]:
trx_df['equal_or_lower_than_4?'] == 'True'

0     True
1     True
2     True
3     True
4    False
5    False
6    False
7    False
8    False
9    False
Name: equal_or_lower_than_4?, dtype: bool

In [ ]:
# Multuple Conditioning

In [ ]:
trx_df[~trx_df.FINAL_CD.isin(FINAL_CD_list) &    trx_df.DAW_CCD.isin(DAW_CCD_list)] [:5]

In [ ]:
# DAYS TIMES SEX_CCD AGE_GB MIN
# 2 02 M 01_25 9.68

In [ ]:
# subset01 = df[df.DAYS == 1 & df.TIMES == '1' & df.SEX_CCD == 'M' & df.AGE_GB == '01']
# subset02 = df[df.DAYS == 1 & df.TIMES == '' & df.SEX_CCD == 'M' & df.AGE_GB == '01']
# subset03 = df[df.DAYS == 1 & df.TIMES == '' & df.SEX_CCD == 'M' & df.AGE_GB == '01']
# subset04 = df[df.DAYS == 1 & df.TIMES == '' & df.SEX_CCD == 'M' & df.AGE_GB == '01']
# subset05 = df[df.DAYS == 1 & df.TIMES == '' & df.SEX_CCD == 'M' & df.AGE_GB == '01']

# subset06 = df[df.DAYS == 1 & df.TIMES == '' & df.SEX_CCD == 'M' & df.AGE_GB == '01']
# subset07 = df[df.DAYS == 1 & df.TIMES == '' & df.SEX_CCD == 'M' & df.AGE_GB == '01']
# subset08 = df[df.DAYS == 1 & df.TIMES == '1' & df.SEX_CCD == 'M' & df.AGE_GB == '01']
# ...

In [ ]:
# subset01.loc[subset01.SLS_CNT >= MIN, 'result'] = 'True'
# subset01.loc[subset01.SLS_CNT <  MIN, 'result'] = 'False' 

# print(df)

In [ ]:
# x

In [135]:
trx_df.head()

,CLNN,TS_D,FINAL_CD,SAA,MCT_ADM_GDS_APB_CD,DOF_TF,DAW_CCD,MCT_N,TIME,TIMES,DAYS
0,14437,2018-07-19,25,11,26,0,5,36,199982,저녁,0
1,2414,2018-07-09,10,7,35,0,0,88,57272,심야,0
2,2136,2018-07-28,82,9,2,0,2,83,135636,점심,0
3,15588,2018-07-13,72,16,21,1,1,60,156460,오후,0
4,6377,2018-07-28,37,14,31,0,2,58,2430,심야,0

In [122]:
# TIMES 컬럼 만들기
conditions = [
    (trx_df['TIME'] >= 0) & (trx_df['TIME'] < 70000),
    (trx_df['TIME'] >= 70000) & (trx_df['TIME'] < 110000),
    (trx_df['TIME'] >= 110000) & (trx_df['TIME'] < 140000),
    (trx_df['TIME'] >= 140000) & (trx_df['TIME'] < 180000),
    (trx_df['TIME'] >= 180000) & (trx_df['TIME'] < 210000),
    (trx_df['TIME'] >= 210000) & (trx_df['TIME'] < 240000),
]

choices = ['심야', '아침오전', '점심', '오후', '저녁', '밤']
trx_df['TIMES'] = np.select(conditions, choices, default='기타')

In [134]:
# DAYS 컬럼 만들기
conditions = [
    (trx_df['DAW_CCD'] >= 0) & (trx_df['TIME'] >= 4),
    (trx_df['DAW_CCD'] == 5),
    (trx_df['DAW_CCD'] == 6)
]

choices = [0, 1, 2] # 0 = 평일, 1=토요일, 2=일요일
trx_df['DAYS'] = np.select(conditions, choices, default='999')

In [ ]:
# trx_tpo_gb00 = pd.DataFrame(
#     trx_df.groupby(['CLNN', 'DAYS', 'TIMES'].agg({'TS_D':'count', 'SLS_TS_N':'count', 'SAA':'sum'})
#                   ))

In [136]:
trx_tpo_gb01 = pd.DataFrame(
    trx_df.groupby(['CLNN', 'DAYS', 'TIMES']).agg({'TS_D':'count', 'SAA':'count', 'SAA':'sum'}))
trx_tpo_gb01[:20]

                 TS_D  SAA
CLNN DAYS TIMES
0    0    밤         5   61
          심야       11  156
          아침오전      5   78
          오후       10  199
          저녁        5   81
          점심        5  109
1    0    밤        10  166
          심야       19  432
          아침오전     14  205
          오후       11  229
          저녁        7  165
          점심       17  328
2    0    밤         9  186
          심야       25  460
          아침오전     11  237
          오후       13  204
          저녁       11  221
          점심        8  197
3    0    밤         6  165
          심야       28  568

In [149]:
trx_tpo_gb01.to_csv('trx_tpo_gb01.csv')

In [184]:
trx_tpo_gb01 = pd.read_csv('trx_tpo_gb01.csv')
trx_tpo_gb01[:15]

    CLNN  DAYS TIMES  TS_D  SAA
0      0     0     밤     5   61
1      0     0    심야    11  156
2      0     0  아침오전     5   78
3      0     0    오후    10  199
4      0     0    저녁     5   81
5      0     0    점심     5  109
6      1     0     밤    10  166
7      1     0    심야    19  432
8      1     0  아침오전    14  205
9      1     0    오후    11  229
10     1     0    저녁     7  165
11     1     0    점심    17  328
12     2     0     밤     9  186
13     2     0    심야    25  460
14     2     0  아침오전    11  237

In [181]:
# demo 파일 확인
demo.info()
demo.sort_values('CLNN')[:10]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31190 entries, 0 to 31189
Data columns (total 3 columns):
CLNN       31190 non-null int64
AGE_GB     31190 non-null int64
SEX_CCD    31190 non-null object
dtypes: int64(2), object(1)
memory usage: 731.1+ KB

       CLNN  AGE_GB SEX_CCD
3124      0       3       M
6165      1       2       F
9376      2       1       M
5352      3       2       M
8134      4       2       M
6043      5       5       F
16530     6       4       M
9142      7       5       M
8360      8       2       M
15917     9       3       F

In [165]:
len(demo.CLNN.unique())

31190

In [180]:
# trx_tpo_gb00의 CLNN 컬럼과 demo.csv의 'CLNN', 'SEX_CCD', 'AGE_GB' 정보 매칭
usecols = ['CLNN', 'AGE_GB', 'SEX_CCD']
demo = pd.read_csv('demo.csv', usecols=usecols)

In [208]:
objs = [trx_tpo_gb01, demo]
trx_tpo_gb00_demo = pd.concat(objs, sort=False, axis=0, keys=['CLNN'])
trx_tpo_gb00_demo.info()
trx_tpo_gb00_demo[:10]

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 146617 entries, (CLNN, 0) to (CLNN, 146616)
Data columns (total 5 columns):
CLNN     146617 non-null int64
DAYS     146617 non-null int64
TIMES    146617 non-null object
TS_D     146617 non-null int64
SAA      146617 non-null int64
dtypes: int64(4), object(1)
memory usage: 6.3+ MB

        CLNN  DAYS TIMES  TS_D  SAA
CLNN 0     0     0     밤     5   61
     1     0     0    심야    11  156
     2     0     0  아침오전     5   78
     3     0     0    오후    10  199
     4     0     0    저녁     5   81
     5     0     0    점심     5  109
     6     1     0     밤    10  166
     7     1     0    심야    19  432
     8     1     0  아침오전    14  205
     9     1     0    오후    11  229

In [209]:
trx_tpo_gb00_demo.tail()

              CLNN  DAYS TIMES  TS_D  SAA
CLNN 146612  47645     0    점심     1   13
     146613  47954     0    심야     1   14
     146614  48262     0     밤     1   16
     146615  48506     0  아침오전     1    6
     146616  52504     0    점심     1    9

In [210]:
trx_tpo_gb00_demo.to_csv('trx_tpo_gb00_demo.csv')

In [97]:
# y 
cutoff_time_new_min = pd.read_csv('cutoff_time_new_min.csv')
cutoff_time_new_min.info()
cutoff_time_new_min.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 180 entries, 0 to 179
Data columns (total 5 columns):
DAYS       180 non-null int64
TIMES      180 non-null int64
SEX_CCD    180 non-null object
AGE_GB     180 non-null int64
MIN        180 non-null float64
dtypes: float64(1), int64(3), object(1)
memory usage: 7.1+ KB

   DAYS  TIMES SEX_CCD  AGE_GB   MIN
0     0      1       M       1  2.30
1     0      1       M       1  0.24
2     0      1       M       1  2.31
3     0      1       M       1  6.27
4     0      1       M       1  2.23

In [ ]:
def add_result_id(x):
    result_df = cutoff_time_new_min.apply(lambda y: y['MIN'] if
                               (x['DAYS'] == y['DAYS'] and 
                                x['TIMES'] == y['TIMES'] and 
                                x['SEX_CCD'] == y['SEX_CCD'] and 
                                x['AGE_GB'] == y['AGE_GB'])
                               else None, axis=1)
    result = result_df.dropna(axis=0, how='all')
    if result_df.empty:
        result_df = np.nan
    else:
        result_df = result_df.to_string(index=False)
        
    return result_df

demo['MIN'] = trx_tpo_gb00_demo.apply(add_result_id, axis=1)n

In [ ]:
# def add_batch_id(x):
#     batch_df = batches_df.apply(lambda y: y['batch_id'] if
#                                (x['shippping_date'] >= y['start_date'] and x['shipping_date'] <= y['end_date']
#                                and x['product_id'] == y['product_id'])
#                                else None, axis=1)
#     batch_df = batch_df.dropna(axis=0, how='all')
#     if batch_df.empty:
#         batch_df = np.nan
#     else:
#         batch_df = batch_df.to_string(index=False)
        
#     return batch_df

# df['batch_id'] = df.apply(add_batch_id, axis=1)